ruby/roamer/app/controllers/favorites_controller.rb

  def show
    @favorite = Favorite.find(params[:id])
---
SELECT * FROM `favorites` WHERE (`favorites`.`id` = 1)

  def list
    favorites = Favorite.find(:all, :conditions => "host_uid like '#{params[:id]}'")
    require 'pp'
    p "^^^^^^^^^^^^^^^^^^^^^^^^"
    p favorites.inspect
    users = favorites.map { |item|  User.find_by_uid(item.guest_uid) }
---
SELECT * FROM `favorites` WHERE (`favorites`.`host_uid` = '1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`uid` = '267425326') LIMIT 1

  def edit
    @favorite = Favorite.find(params[:id])
---
SELECT * FROM `favorites` WHERE (`favorites`.`id` = 1)

  def create
    hash = params[:favorite]

    name = hash.delete('guest_name')
    image_url = hash.delete('guest_image_url')
    uid = hash[:guest_uid]
    if(!User.find_by_uid(uid))
      user = User.new(:uid => uid, :name => name, :image_url => image_url)
      user.save
    end

    @favorite = Favorite.new(hash)

    respond_to do |format|
      if @favorite.save
---
SELECT * FROM `users` WHERE (`users`.`uid` = '126549917') LIMIT 1
INSERT INTO `users` (`name`, `image_url`, `updated_at`, `uid`, `created_at`) VALUES('jingmouren', 'http://hdn311.xnimg.cn/photos/hdn311/20090312/20/45/tiny_oCd9_25837p204235.jpg', '2009-03-22 09:58:28', NULL, '2009-03-22 09:58:28')
INSERT INTO `favorites` (`updated_at`, `host_uid`, `guest_uid`, `created_at`) VALUES('2009-03-22 07:57:40', '1', '2', '2009-03-22 07:57:40')

  def destroy
    @favorite = Favorite.find(params[:id])
    @favorite.destroy
---
SELECT * FROM `favorites` WHERE (`favorites`.`id` = 3)
DELETE FROM `favorites`